Revit 2026 API

# ElementMulticategoryFilter(ICollectionElementId, Boolean) Constructor

---

Initializes a new instance of the ElementMulticategoryFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementMulticategoryFilter(
	ICollection<ElementId> categoryIds,
	bool inverted
)
```
```vb
Public Sub New (
	categoryIds As ICollection(Of ElementId),
	inverted As Boolean
)
```
```cpp
public:
ElementMulticategoryFilter(
	ICollection<ElementId^>^ categoryIds,
	bool inverted
)
```
```fsharp
new :
        categoryIds : ICollection<ElementId> *
        inverted : bool -> ElementMulticategoryFilter
```

#### Parameters

categoryIds ICollectionElementId

inverted Boolean

#### Reference

ElementMulticategoryFilter Class

ElementMulticategoryFilter Overload

Autodesk.Revit.DB Namespace